{--
Задача 21-1
Одеров Роман, 545 гр.
--}

{-
[1,3,7,11,13,17,31,33,37,71,73,77,...] <=>
[1,3,7] ++ [11,13,17,  31,33,37,  71,73,77] ++ ...
-}

{-
lst137' = [1,3,7] ++ (map (
						\xs -> foldl (++)
									[] 
									(map (\x->[10*x+1,10*x+3,10*x+7]) xs)
						)
						lst137')

--Не работает с оператором ++. Пришлось попробовать так:
-}

lst137' = [1,3,7] : (map (
						\xs -> foldr (++)
									[] 
									(map (\x->[10*x+1,10*x+3,10*x+7]) xs)
						)
						lst137')

lst137 = foldr (++) [] lst137'