{--
Задача 21-2
Одеров Роман, 545 гр.
--}

{-----------------------------------------
a). Тип foldr:
(a->b->b)->b->[a]->b

Haskell сказал по поводу ":t foldr":
foldr :: (a -> b -> b) -> b -> [a] -> b

Сошлось :-)
----------------------------------------
b). Алгоритм Хиндли-Милнера:

foldr f e (x:xs) = f x (foldr f e xs)
foldr f e [] = e

Этап 1-ый
*	x1->x2->x3->x4
*	x1 = функция 2-х аргументов, т.к. это видно, когда применяется f x (foldr f e xs)
	x1 = x5 -> x6 -> x7
*	x3 = массив элементов. Т.е. x3 = [x8]

Итого: (x5->x6->x7)->x2->[x8]->x4

Этап 2-ой
*	x2 = x4, т.к. во втором правиле 'e'-параметр и 'e' - результат foldr
	(x5->x6->x7)->x2->[x8]->x2

*	f применяется к аргументам элемент списка(=x8) и результату foldr (который есть x2)
	Тип результата f = тип результата foldr (x2)
	Т.о. x5=x8, x6=x7=x2:
	(x8->x2->x2)->x2->[x8]->x2

Итог: 
(x8->x2->x2)->x2->[x8]->x2, т.е.
(a ->b ->b )->b ->[a] ->b
-----------------------------------------}